!pip install --upgrade pip
!pip install SQLAlchemy==1.3
!pip install pyhive[hive]
!pip install thrift
!pip install sasl
!pip install thrift-sasl 
!pip install psycopg2

In [10]:
from sqlalchemy.engine import create_engine
import pandas as pd

engine = create_engine("hive://spark-thrift:10000/default")
pd.read_sql("show databases;", con=engine)

  namespace
0   default
1    sample

In [3]:
pd.read_sql_query("create database IF NOT EXISTS sample;", con=engine)
pd.read_sql_query("use sample;", con=engine)
pd.read_sql_query("show tables;", con=engine)

  namespace        tableName  isTemporary
0    sample         employee        False
1    sample         tb_sev_u        False
2    sample          tb_test        False
3    sample  tb_test_qf_stat        False

In [4]:
pd.read_sql_query("create table if not exists employee ( eid int, name String );", con=engine)

Empty DataFrame
Columns: [Result]
Index: []

In [5]:
pd.read_sql_query("insert into employee values (1, 'a') , (2, 'b');", con=engine)

Empty DataFrame
Columns: [Result]
Index: []

In [6]:
pd.read_sql_query("select * from sample.employee limit 10;", con=engine)

   eid name
0    1    a
1    1    a
2    1    a
3    2    b
4    2    b
5    2    b

In [9]:
engine.dispose()